### VLAN Ranges on Catalyst Switches
##### 1. Normal range
- Rozsah 1-1005
- Uložení vlan.dat
- Používají se běžně v LAN sítích
##### 2. Extended range 
- Rozsah 1006-4094
- Uložení running-config
- Používají se u providerů / velkých sítí

#### Další info
- VLANy 1 a 1002-1005 jsou automaticky vytvořené a nejdou smazat
- VTP synchronizuje VLANy mezi switchi
- Extended VLANs vyžadují VTP transparent mode
- Max. počet VLAN = 4096 (12b ID)

`show vlan brief` - pro zobrazení VLANů

### VLAN Creation Commands

```
Switch(config)# vlan <vlan-id>
Switch(config-vlan)# name <vlan-name>
Switch(config-vlan)# end
```

### VLAN Port Assignment Commands

```
Switch(config)# interface fa0/6
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch(config-if)# end
```

### Data and Voice VLANs

- Port může mít **1 data VLAN** + **1 voice VLAN** (např. pro IP telefon).
- IP phone = malý switch: připojuje PC + telefon. 
- Data jdou do **VLAN 20**, hlas do **VLAN 150**.

```
Switch(config)# interface fa0/18
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch(config-if)# switchport voice vlan 150
```

### Verify VLAN Information
```
show vlan brief
show vlan id 20
show vlan name student
show vlan summary
```

### Change VLAN Port Membership
```
Switch(config)# interface fa0/18
Switch(config-if)# switchport access vlan 20
Switch(config)# interface fa0/18
Switch(config-if)# no switchport access vlan
```

### Delete VLANs
Smazání konkrétní VLAN
```
Switch(config)# no vlan 20
```
Reset všech VLAN
```
Switch# delete flash:vlan.dat
Switch# reload
```
Factory reset VLANů
```
Switch# erase startup-config
Switch# delete vlan.dat
Switch# reload
```